---
kind: type
id: T:Autodesk.Revit.DB.SymbolTypeId
source: html/6f430fd2-cbd1-237a-d4f5-4c9697e945e1.htm
---
# Autodesk.Revit.DB.SymbolTypeId

This class contains constants identifying symbols.

## Syntax (C#)
```csharp
public static class SymbolTypeId
```